//########################################################
//########################################################
           //FUNÇÕES UTILIZADAS NAS TELAS
//########################################################
//########################################################


//########################################################
//VERIFICA SE ESTÁ VAZIO
//########################################################
function empty(mixed_var) {
    var undef, key, i, len;
    var emptyValues = [undef, null, 'null', ''];

    for (i = 0, len = emptyValues.length; i < len; i++) {
        if (mixed_var === emptyValues[i]) {
            return true;
        }
    }

    if (typeof mixed_var === 'object') {
        for (key in mixed_var) {
            // TODO: should we check for own properties only?
            //if (mixed_var.hasOwnProperty(key)) {
                return false;
            //}
        }
        return true;
    }

    return false;
}



//########################################################
//########################################################
           //FIM FUNÇÕES UTILIZADAS NAS TELAS
//########################################################
//########################################################














//########################################################
//########################################################
                //FUNÇÕES PAGE TRABALHO
//########################################################
//########################################################



$(document).ready(function(){
    
    //########################################################
    //QUANDO CLICAR NO TRABALHO URL É MUDADA AUTOMATICAMENTE
    //########################################################
    $(".grid-wrap .grid figure").on("click", function(){
        var zelda = $(this).attr('trabalho');
        setTimeout(function(){window.history.pushState('', '', "/trabalhos/"+zelda+"/");},600);
    });
    
    //########################################################
    //SE O INPUT ESTIVER PREENCHIDO TENTA ABRIR O TRABALHO QUE ELE ESTÁ TENTANDO ACESSAR
    //########################################################   
    if(!empty($("#link_trabalho").val())){
        $(".grid-wrap .grid figure[trabalho="+$("#link_trabalho").val()+"]").click();
    }
});




//########################################################
//########################################################
                //FIMM FUNÇÕES PAGE TRABALHO
//########################################################
//########################################################


















//########################################################
//########################################################
                //FUNÇÕES DOS MENUS
//########################################################
//########################################################


$(document).ready(function(){
    $("a.contato").click(function(){
        //########################################################
        //COPIA EMAIL E AVISA QUE FOI COPIADO
        //########################################################
        var $temp = $("<input>");
        $("body").append($temp);
        $temp.val($(this).attr('email')).select();
        document.execCommand("copy");
        $temp.remove();
        swal({
                title: "E-mail copiado! \n use CTRL+V!",
                type: "success",
                showConfirmButton: false,
                timer: 2000,
            }
        );
    }); 
});



//########################################################
//########################################################
                //FIM FUNÇÕES DOS MENUS
//########################################################
//########################################################